app/controllers/statuses_controller.rb

  def show
    @status = Status.find(params[:id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @status = Status.find(params[:id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @status = current_user.statuses.new(params[:status])

    respond_to do |format|
      if @status.save
---
INSERT INTO "statuses" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "Hello Testing"], ["created_at", Fri, 23 May 2014 11:21:41 UTC +00:00], ["updated_at", Fri, 23 May 2014 11:21:41 UTC +00:00], ["user_id", 1]]

  def update
    @status = current_user.statuses.find(params[:id])
    if params[:status] && params[:status].has_key?(:user_id)

      params[:status].delete(:user_id)

    end
    respond_to do |format|
      if @status.update_attributes(params[:status])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."user_id" = 1 AND "statuses"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "statuses" SET "user_id" = 1027431151, "updated_at" = '2014-05-29 11:41:18.294628' WHERE "statuses"."id" = 980190962

  def destroy
    @status = Status.find(params[:id])
    @status.destroy
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 1]]