app/controllers/user_friendships_controller.rb

SELECT "users".* FROM "users" WHERE "users"."profile_name" = 'testy' LIMIT 1
---
	  def new
    if params[:friend_id]
      @friend = User.where(profile_name: params[:friend_id]).first